package InterviewTest.Meituan.meituan2021.meituan;

public class meituan04 {
    /**
     * 小美最近买了一个小火车，小火车的每一节车厢都可以用一个小写字母表示。小美想知道，对于火车的某个前缀，其第k短的周期的长度是几。
     *
     * 定义周期为：对于一个长度为n的字符串，如果有一个长度为k的周期，当且仅当其满足对于所有1≤i≤n-k，都有si=si+k成立。
     *
     *
     *
     * 输入描述
     * 第一行一个字符串，字符串只由小写英文字母组成，长度最多为105。
     *
     * 第二行一个数字q(1≤q≤105)，代表询问的组数。
     *
     * 接下来q行，每行两个空格隔开的数字u(1≤u≤n),k(1≤k≤105)代表询问的前缀长度和周期次序k。
     *
     * 输出描述
     * 对于每组询问输出一行一个整数代表长度为 u 的前缀的第 k 短的周期长度。如果k大于该前缀所有的周期数量，则输出一行一个整数 -1。
     */
}
